#include <iostream>

void menu() {
    std::cout << "\n _________________________________";
    std::cout << "\n|     Главное меню справочника    |";
    std::cout << "\n|---------------------------------|";
    std::cout << "\n| 1: Просмотр всех рейсов.        |";
    std::cout << "\n| 2: Просмотр рейсов по фильтру.  |";
    std::cout << "\n| 3: Просмотр интересующего рейса.|";
    std::cout << "\n|---------------------------------|";
    std::cout << "\n| 4: Добавление нового рейса.     |";
    std::cout << "\n| 5: Изменение деталей рейса.     |";
    std::cout << "\n| 6: Добавить новые детали рейсов.|";
    std::cout << "\n|---------------------------------|";
    std::cout << "\n| 7: Удаление рейса из расписания.|";
    std::cout << "\n| 8: Удалить все рейсы.           |";
    std::cout << "\n|---------------------------------|";
    std::cout << "\n| 0: Выход из справочника.        |";
    std::cout << "\n|_________________________________|\n";
}