#include <iostream>

void menu()
{
    std::cout << "\n _________________________________";
    std::cout << "\n|                                 |";
    std::cout << "\n|     Главное меню справочника    |";
    std::cout << "\n|                                 |";
    std::cout << "\n|---------------------------------|";
    std::cout << "\n| 1: Все билеты.                  |";
    std::cout << "\n| 2: Свободные билеты.            |";
    std::cout << "\n| 3: Просмотр нужного билета.     |";
    std::cout << "\n|---------------------------------|";
    std::cout << "\n| 4: Добавление новых билетов.    |";
    std::cout << "\n| 5: Изменение деталей билета.    |";
    std::cout << "\n|---------------------------------|";
    std::cout << "\n| 6: Удаление билета из базы.     |";
    std::cout << "\n| 7: Удалить все билеты.          |";
    std::cout << "\n|---------------------------------|";
    std::cout << "\n|                                 |";
    std::cout << "\n|        8: Купить билеты!        |";
    std::cout << "\n|                                 |";
    std::cout << "\n|---------------------------------|";
    std::cout << "\n|                                 |";
    std::cout << "\n| 0: Выход из программы.          |";
    std::cout << "\n|_________________________________|\n";
}
void poisk()
{
    std::cout << "\n _________________________________";
    std::cout << "\n|   Свойства для поиска автобуса  |";
    std::cout << "\n|---------------------------------|";
    std::cout << "\n|                                 |";
    std::cout << "\n| 1: Дата выезда.                 |";
    std::cout << "\n| 2: Пункт назначения.            |";
    std::cout << "\n| 3: Время отправления.           |";
    std::cout << "\n| 4: Время прибытия.              |";
    std::cout << "\n| 5: Число свободных мест.        |";
    std::cout << "\n| 0: Выход.                       |";
    std::cout << "\n|_________________________________|\n";
}