#include <iostream>

void menu() {
    std::cout << "\n _________________________________";
    std::cout << "\n|     Главное меню справочника    |";
    std::cout << "\n|---------------------------------|";
    std::cout << "\n| 1: Просмотр всех рейсов.        |";
    std::cout << "\n| 2: Просмотр рейсов по фильтру.  |";
    std::cout << "\n| 3: Просмотр интересующего рейса.|";
    std::cout << "\n|---------------------------------|";
    std::cout << "\n| 4: Добавление нового рейса.     |";
    std::cout << "\n| 5: Изменение деталей рейса.     |";
    std::cout << "\n|---------------------------------|";
    std::cout << "\n| 6: Удаление рейса из расписания.|";
    std::cout << "\n| 7: Удалить все рейсы.           |";
    std::cout << "\n|---------------------------------|";
    std::cout << "\n| 0: Выход из справочника.        |";
    std::cout << "\n|_________________________________|\n";
}
void poisk() {
    std::cout << "\n _________________________________";
    std::cout << "\n|   Свойства для поиска автобуса  |";
    std::cout << "\n|---------------------------------|";
    std::cout << "\n| 1: Номер автобуса.              |";
    std::cout << "\n| 2: Тип автобуса.                |";
    std::cout << "\n| 3: Пункт назначения.            |";
    std::cout << "\n| 4: Время отправления.           |";
    std::cout << "\n| 5: Время прибытия.              |";
    std::cout << "\n| 0: Выход.                       |";
    std::cout << "\n|_________________________________|\n";
}